Revit 2024 API
BuiltInFailures.CurtainWallFailures.NonSupportedCurtainWall Property
 Currently, only straight Walls with straight or arc edges are supported for non-rectangular Curtain Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NonSupportedCurtainWall { get; }
Visual Basic
Public Shared ReadOnly Property NonSupportedCurtainWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NonSupportedCurtainWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace